function dateSelect() {
	const calendareInput = document.querySelector(".date-select");
	const resetBtn = document.querySelector("[data-reset-date-select]");
	if (!calendareInput) return;
	try {
		const dp = new AirDatepicker(calendareInput, {
			range: true,
			multipleDatesSeparator: " - ",
			autoClose: true,
			showOtherMonths: false,
			locale: {
				days: [
					"Воскресенье",
					"Понедельник",
					"Вторник",
					"Среда",
					"Четверг",
					"Пятница",
					"Суббота",
				],
				daysShort: ["Вс", "Пн", "Вт", "Ср", "Чт", "Пт", "Сб"],
				daysMin: ["Вс", "Пн", "Вт", "Ср", "Чт", "Пт", "Сб"],
				months: [
					"Январь",
					"Февраль",
					"Март",
					"Апрель",
					"Май",
					"Июнь",
					"Июль",
					"Август",
					"Сентябрь",
					"Октябрь",
					"Ноябрь",
					"Декабрь",
				],
				monthsShort: [
					"Янв",
					"Фев",
					"Мар",
					"Апр",
					"Май",
					"Июн",
					"Июл",
					"Авг",
					"Сен",
					"Окт",
					"Ноя",
					"Дек",
				],
				dateFormat: "dd.mm.yyyy", // ← формат для hidden input (ISO)
				firstDay: 1,
			},
			prevHtml: ` <svg width="29" height="15" viewBox="0 0 29 15" fill="none" xmlns="http://www.w3.org/2000/svg">
					<path d="M27.4141 8.36395C27.9663 8.36395 28.4141 7.91624 28.4141 7.36395C28.4141 6.81167 27.9663 6.36395 27.4141 6.36395L27.4141 7.36395L27.4141 8.36395ZM0.292322 6.65685C-0.0982018 7.04737 -0.0982017 7.68054 0.292322 8.07106L6.65629 14.435C7.04681 14.8255 7.67997 14.8255 8.0705 14.435C8.46102 14.0445 8.46102 13.4113 8.0705 13.0208L2.41364 7.36395L8.0705 1.7071C8.46102 1.31658 8.46102 0.68341 8.0705 0.292886C7.67997 -0.0976383 7.04681 -0.0976383 6.65628 0.292886L0.292322 6.65685ZM27.4141 7.36395L27.4141 6.36395L0.99943 6.36395L0.99943 7.36395L0.99943 8.36395L27.4141 8.36395L27.4141 7.36395Z" />
					</svg>
					`,
			nextHtml: `
					 <svg width="29" height="15" viewBox="0 0 29 15" fill="none" xmlns="http://www.w3.org/2000/svg">
					<path d="M1 8.36395C0.447715 8.36395 -6.71241e-08 7.91624 0 7.36395C6.71241e-08 6.81167 0.447715 6.36395 1 6.36395L1 7.36395L1 8.36395ZM28.1217 6.65685C28.5123 7.04737 28.5123 7.68054 28.1217 8.07106L21.7578 14.435C21.3673 14.8255 20.7341 14.8255 20.3436 14.435C19.953 14.0445 19.953 13.4113 20.3436 13.0208L26.0004 7.36395L20.3436 1.7071C19.953 1.31658 19.953 0.68341 20.3436 0.292886C20.7341 -0.0976383 21.3673 -0.0976383 21.7578 0.292886L28.1217 6.65685ZM1 7.36395L1 6.36395L27.4146 6.36395L27.4146 7.36395L27.4146 8.36395L1 8.36395L1 7.36395Z" />
					</svg>
					`,
			navTitles: {
				days: "MMMM yyyy",
			},
		});
		// Сброс
		if (resetBtn) {
			resetBtn.addEventListener("click", () => {
				dp.clear();
			});
		}
	} catch (error) {
		throw new Error("Поключите бибилотеку Air datapicker");
	}
}
dateSelect();
